recipes/1-pot-lentil-dal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1 Pot Lentil Dal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">1 Pot Lentil Dal</h1>
<p>
<a href="https://minimalistbaker.com/1-pot-lentil-dal/">Original link</a>
</p>

<div id="outline-container-org7319ede" class="outline-2">
<h2 id="org7319ede">Ingredients</h2>
<div class="outline-text-2" id="text-org7319ede">
<ul class="org-ul">
<li>Rice</li>
<li>2 Tbsp (30 g) coconut oil*</li>
<li>optional: 1 small green chili</li>
<li>1 Tbsp (3 g) minced fresh ginger</li>
<li>1 shallot, thinly sliced</li>
<li>3 cloves garlic, minced (1.5 Tbsp or 9 g)</li>
<li>4 Tbsp (60 g) Green Curry Paste (DIY or store-bought)</li>
<li>2 1/4 cups (540 ml) light coconut milk* (canned is best)</li>
<li>1 tsp ground turmeric</li>
<li>1 tsp curry powder (store-bought or DIY)</li>
<li>Pinch each sea salt + black pepper</li>
<li>1 cup (192 g) green lentils*, well rinsed and drained</li>
<li>1 tsp coconut aminos or tamari (or soy sauce if not GF)</li>
<li>1-2 Tbsp (12-24 g) coconut sugar or maple syrup (or other sweetener to taste)</li>
<li>2 Tbsp (30 ml) fresh lemon juice</li>
<li>optional: pinch cayenne pepper (for more heat), cilantro and lemon/lime wedges</li>
</ul>
</div>
</div>

<div id="outline-container-org928cf3b" class="outline-2">
<h2 id="org928cf3b">Method</h2>
<div class="outline-text-2" id="text-org928cf3b">
<ol class="org-ol">
<li>Set rice cooking</li>
<li>Heat a large pot over medium heat. Once hot, add coconut oil, green chili (optional), ginger, shallot, and garlic. Saute for 3-4 minutes, stirring occasionally. Reduce heat if browning too quickly.</li>
<li>Add curry paste and stir to coat. Saute for another 2-3 minutes. Then add coconut milk, turmeric, curry powder, salt, and pepper. Stir to combine.</li>
<li>Bring to a simmer over medium heat. Once simmering, add the lentils, coconut aminos (or tamari), coconut sugar (or maple syrup), and lemon juice and stir.</li>
<li>Bring the mixture back to a simmer, and then reduce heat to low or medium-low and continue gently simmering for 15-20 minutes or until lentils are tender.</li>
<li>Once the lentils are tender, taste and adjust flavor as needed, adding more lemon juice for acidity, a pinch of cayenne for heat (optional), curry powder or paste for more intense curry flavor, salt for saltiness, or coconut sugar or maple syrup for sweetness. The curry should be equally tangy and salty with a hint of sweetness and spice.</li>
<li>Serve the dal as is or over rice of choice (I love white or brown rice, but it's also delicious over cauliflower rice). Garnish with lemon or lime wedges and cilantro (optional).</li>
<li>Store leftovers in the refrigerator up to 4-5 days or in the freezer for 1 month.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
